# 標準入力について -----------------------------

# input("入力 : ")  # 標準入力、文字列で渡される

int("5")    # 文字列を整数に変更する int = integer

#-------------------------------------------

# 演算子 ------------------------------------

# print( 4 / 2 )    # 2.0 と除算は浮動小数点での出力
# print( 5 // 2 )   # 2 と浮動小数点を切り下げて表示
# print( 2 ** 3 )   # 2の3乗  ** n で n乗

# 文字列の入力と出力 ----------------------------

str = 'python'
# print(str[-1])    # 文字列に対してインデックスを渡すことでスライスができる。 n が出力

# ------------------------------------------

# list 配列について ---------------------------

list = ['a', 'b', 'c', 'd', 'e']
print(list[1:4])  # [ 始点 : 終点 ] 始点のindexは含み、終点のindexは含まない = [b,c,d]

list.append('zz')  # array.append() で配列の最後に値を挿入
print(list)

print(len(list))   # len(array) で配列の数を出力


